{"wildchat_question": "Can you help me debug this Python script? I keep getting an `IndexError: list index out of range` on line 42, but I can't figure out why my loop is exceeding the length.", "language": "english", "oracle_questions": ["Is the model processing a programming problem?", "Is the user asking for travel advice?", "What language is the model representing?", "Is the user frustrated with a technical error?", "Is the model thinking about culinary techniques?", "Does this message contain code-related concepts?", "Is the user asking for a creative story?", "What does the user want the model to do?"], "idx": 0}
{"wildchat_question": "I’m feeling really overwhelmed at work lately. My boss keeps piling on projects and I don’t know how to say no without sounding like a slacker. Any tips?", "language": "english", "oracle_questions": ["Is the model representing a workplace conflict?", "Is the user happy and relaxed?", "Does the model detect a sense of stress or overwhelm?", "Is the model thinking about quantum physics?", "Is this conversation related to career advice?", "Does the user want help with a social interaction?", "Is the model processing a request for a recipe?", "Is the main topic about professional boundaries?"], "idx": 1}
{"wildchat_question": "Write a scene where a space marine and a sentient nebula have a conversation about the meaning of time while floating near a black hole.", "language": "english", "oracle_questions": ["Is the model thinking about science fiction concepts?", "Is the user asking for a historical biography?", "Is the model processing a creative writing prompt?", "Does the user want a technical manual for a telescope?", "Is the model representing a dialogue between characters?", "Is this about baking a cake?", "What is the primary genre the model is representing?", "Is the user requesting help with a math equation?"], "idx": 2}
{"wildchat_question": "My boyfriend and I have been arguing a lot about whose turn it is to do the dishes. How can we communicate better about chores?", "language": "english", "oracle_questions": ["Is the model's context about interpersonal relationships?", "Is the user asking for help with computer hardware?", "Is the model thinking about conflict resolution?", "Is the user frustrated with their partner?", "Is the model representing a medical diagnosis?", "What is the main topic of the user's message?", "Is this about learning a new language?", "Does the model detect a request for advice?"], "idx": 3}
{"wildchat_question": "Hey! Just wanted to say hi and see how you're doing today. What's new in the world of AI?", "language": "english", "oracle_questions": ["Is the user being hostile?", "Is the model thinking about general conversation?", "Is this a request for tech support for a broken printer?", "Is the model processing a casual greeting?", "Does the user want information about artificial intelligence?", "Is the model representing a specific math problem?", "Is the tone of the message friendly?", "Is the user asking for legal advice?"], "idx": 4}
{"wildchat_question": "I need to know the chemical formula for photosynthesis and a brief explanation of the Calvin cycle for my biology test tomorrow.", "language": "english", "oracle_questions": ["Is the model representing a scientific process?", "Is the user asking for an opinion on a movie?", "Is the model thinking about cellular biology?", "Is this related to a homework assignment?", "Does the model detect a request for a workout routine?", "What concept is the model processing?", "Is the user asking for a translation into French?", "Is the text focused on plants and energy?"], "idx": 5}
{"wildchat_question": "What are the best places to visit in Tokyo for five days? I love hidden gems, local food, and anything related to anime.", "language": "english", "oracle_questions": ["Is the model thinking about travel planning?", "Is the user asking for a workout plan?", "Does the model represent geographic locations in Japan?", "Is the user's interest related to culture and tourism?", "Is the model processing a request for car repair?", "Is the user looking for recommendations?", "Is this about a video game walkthrough?", "Does the model detect a theme of leisure?"], "idx": 6}
{"wildchat_question": "My sourdough starter isn't bubbling after three days. I used whole wheat flour and filtered water. What am I doing wrong?", "language": "english", "oracle_questions": ["Is the model thinking about culinary or fermentation concepts?", "Is the user frustrated with a coding error?", "Is the model representing a baking problem?", "Does the user want help with their pet?", "Is the model detecting a request for troubleshooting?", "Is this related to interior design?", "What is the main subject being processed?", "Is the user asking for a stock market forecast?", "Does this involve food preparation?"], "idx": 7}
{"wildchat_question": "I can't believe the service I received at your store today. The manager was incredibly rude and I want a full refund immediately.", "language": "english", "oracle_questions": ["Is the model detecting anger or dissatisfaction?", "Is the user asking for a joke?", "Is the model representing a customer service complaint?", "Does the model think the user is happy?", "Is the text related to a commercial transaction?", "Is the model processing a request for a refund?", "Is this about gardening?", "What emotion is the user expressing?"], "idx": 8}
{"wildchat_question": "Explain the \"Ship of Theseus\" paradox. If every part of a ship is replaced, is it still the same ship?", "language": "english", "oracle_questions": ["Is the model thinking about philosophical concepts?", "Is the user asking for a sports score?", "Is the model representing a thought experiment?", "Is this related to maritime law?", "Does the model detect a question about identity and logic?", "Is the user asking for a poem?", "What is the main topic?", "Is the model processing a request for a historical date?"], "idx": 9}
{"wildchat_question": "My laptop screen is flickering and there are green lines running vertically across the display. Is this a hardware issue?", "language": "english", "oracle_questions": ["Is the model representing a tech support scenario?", "Is the user asking for a fashion recommendation?", "Is the model thinking about computer hardware?", "Is the model detecting a user problem?", "Is this dialogue about a romantic relationship?", "Does the user want a diagnosis for their device?", "Is the model processing a request for a recipe?", "What is the core subject of the message?"], "idx": 10}
{"wildchat_question": "I'm stuck on level 4 of Elden Ring's DLC. How do I beat the first major boss? I'm using a strength build.", "language": "english", "oracle_questions": ["Is the model thinking about video game mechanics?", "Is the user asking for help with a real-life job interview?", "Is the model representing a gaming strategy?", "Is the user expressing enjoyment?", "Does the model detect a request for a walkthrough or tips?", "Is this about high-altitude hiking?", "What activity is the user engaged in?", "Is the model processing a political debate?"], "idx": 11}
{"wildchat_question": "If you have a fever over 103 degrees and a stiff neck, should you go to the ER or just take some Tylenol?", "language": "english", "oracle_questions": ["Is the model representing a health or medical inquiry?", "Is the user asking about a car engine?", "Is the model thinking about emergency symptoms?", "Does this involve a request for medical guidance?", "Is the model processing a question about a trip to the zoo?", "Is the user's tone urgent?", "Is the model thinking about fashion?", "What is the user's primary concern?"], "idx": 12}
{"wildchat_question": "Can you draft a formal resignation letter? I’m leaving my current role for a better opportunity at a different company.", "language": "english", "oracle_questions": ["Is the model representing a professional writing task?", "Is the user asking for a break-up text?", "Is the model thinking about employment and career changes?", "Does the user want a comedy script?", "Is the model processing a request for a formal document?", "Is this about a vacation request?", "Is the tone of the request professional?", "Is the model representing a scientific theory?"], "idx": 13}
{"wildchat_question": "Let's do a roleplay where you are a grumpy dwarf blacksmith and I am a lost elf looking for a magic sword.", "language": "english", "oracle_questions": ["Is the model thinking about roleplaying or fiction?", "Is the user asking for a weather report?", "Is the model representing a specific character (blacksmith)?", "Is the model processing a fantasy-themed request?", "Does the user want to discuss the stock market?", "Is this related to a Dungeons & Dragons style interaction?", "Is the user being formal and academic?", "What is the user's role in this scenario?"], "idx": 14}
{"wildchat_question": "Can you explain why my Python dictionary isn't keeping its order? I’m using version 3.6, and I thought it was supposed to be ordered now.", "language": "english", "oracle_questions": ["Is the model processing a programming concept?", "Does the user want a recipe?", "What is the model thinking about?", "Is the user expressing deep anger?", "Is this related to Python data structures?", "Is the model detecting a request for travel tips?", "What does the user want to understand?", "Is the model's context about historical events?", "Is this asking for technical help?", "Is the model representing a mathematical theorem?"], "idx": 15}
{"wildchat_question": "I’m just so tired of my roommate never doing the dishes. Every time I come home, the sink is full. How do I bring this up without starting a huge fight?", "language": "english", "oracle_questions": ["Is the model's context about interpersonal relationships?", "Is the user frustrated?", "Is the model representing a coding problem?", "What is the main topic?", "Is the model thinking about space exploration?", "What does the user want?", "Is this related to conflict resolution?", "Is the model detecting a high level of joy?", "Is the user asking for medical advice?", "What concept is the model processing?"], "idx": 16}
{"wildchat_question": "Write a short story about a clockmaker who discovers a way to pause time, but only for five minutes a day.", "language": "english", "oracle_questions": ["Is the model thinking about creative writing?", "Is the user asking for a scientific paper?", "What is the model representing?", "Is this related to cooking?", "Does the user want a fictional narrative?", "Is the model detecting a sense of urgency?", "What is the main character's profession in the text?", "Is the model processing a travel itinerary?", "Is this a request for roleplay?", "Is the model representing a mechanical or time-related theme?"], "idx": 17}
{"wildchat_question": "Hey! Not much going on here, just chilling. How's your day going so far? Anything exciting happened?", "language": "english", "oracle_questions": ["Is the model's context about a casual conversation?", "Is the user frustrated?", "Is the model thinking about a specific technical problem?", "What is the main topic?", "Is the model detecting a formal tone?", "Is the user asking for help with homework?", "Does this involve programming?", "What is the model processing?", "Is the user seeking an emotional connection or chat?", "Is the model representing a medical diagnosis?"], "idx": 18}
{"wildchat_question": "Can you help me with this calculus problem? I need to find the derivative of f(x) = sin(x^2) using the chain rule.", "language": "english", "oracle_questions": ["Is the model representing a mathematical concept?", "Is the user asking for relationship advice?", "What is the model thinking about?", "Is the user frustrated?", "Is this related to calculus?", "Is the model detecting a request for a poem?", "What does the user want?", "Is the model's context about food and nutrition?", "Does this involve the chain rule?", "Is the model representing a sports strategy?"], "idx": 19}
{"wildchat_question": "*I walk into the tavern, shaking the rain off my cloak, and look for the hooded figure mentioned in the letter.* \"Are you the one they call The Shadow?\"", "language": "english", "oracle_questions": ["Is the model processing a roleplay scenario?", "Is the user asking for tech support?", "What is the model thinking about?", "Is the model detecting a fantasy setting?", "Is this related to cooking?", "What is the user's intent?", "Is the model representing a historical biography?", "Is the user angry?", "Is the model's context about a narrative interaction?", "Does this involve programming?"], "idx": 20}
{"wildchat_question": "What are the best places to visit in Tokyo for five days? I'm really interested in hidden gems and local food stalls, not just the big tourist spots.", "language": "english", "oracle_questions": ["Is the model thinking about travel planning?", "Is the user frustrated?", "What is the main topic?", "Is the model representing a physics experiment?", "Does the user want recommendations?", "Is the model detecting a request for Japan-related info?", "Is this related to programming?", "What concept is the model processing?", "Does the user mention \"hidden gems\"?", "Is the model's context about pet care?"], "idx": 21}
{"wildchat_question": "I need a quick recipe for dinner. I have chicken, spinach, and heavy cream. What can I make in under 30 minutes?", "language": "english", "oracle_questions": ["Is the model representing a cooking concept?", "Is the user asking for car repair advice?", "What is the model thinking about?", "Is the user frustrated?", "Does this involve food preparation?", "Is the model detecting a 30-minute time constraint?", "What does the user want?", "Is the model's context about quantum mechanics?", "Is the user asking for a workout routine?", "Is the model processing an ingredient list?"], "idx": 22}
{"wildchat_question": "Can you explain the difference between dark matter and dark energy? I'm writing a paper for my astronomy class and I'm a bit confused.", "language": "english", "oracle_questions": ["Is the model thinking about science?", "Is the user frustrated?", "What is the main topic?", "Is the model representing a lesson on astronomy?", "Does the user want a short story?", "Is the model detecting a request for academic help?", "Is this related to fashion?", "What concept is the model processing?", "Is the user asking about planetary orbits specifically?", "Is the model's context about space and physics?"], "idx": 23}
{"wildchat_question": "If a tree falls in a forest and no one is around to hear it, does it make a sound? What do different philosophers say about this?", "language": "english", "oracle_questions": ["Is the model representing a philosophical problem?", "Is the user asking for a weather report?", "What is the model thinking about?", "Is the user frustrated?", "Is this related to the \"tree falling in a forest\" thought experiment?", "Is the model detecting a request for coding help?", "What does the user want?", "Is the model's context about gardening?", "Is the user asking about different philosophical perspectives?", "Is the model representing a legal case?"], "idx": 24}
{"wildchat_question": "My PC keeps blue-screening every time I try to launch Cyberpunk 2077. I've already updated my drivers. What should I try next?", "language": "english", "oracle_questions": ["Is the model thinking about tech support?", "Is the user frustrated?", "What is the main topic?", "Is the model representing a gaming-related issue?", "Does the user want a movie review?", "Is the model detecting a hardware or software problem?", "Is this related to gardening?", "What is the user seeking?", "Is the model's context about a physical health issue?", "Does the text mention \"Cyberpunk 2077\"?"], "idx": 25}
{"wildchat_question": "I'm feeling a sharp pain in my lower back whenever I sit for more than 20 minutes. What could be causing this?", "language": "english", "oracle_questions": ["Is the model processing a health-related query?", "Is the user asking for a travel itinerary?", "What is the model thinking about?", "Is the user experiencing physical discomfort?", "Is this related to programming?", "Is the model detecting a request for medical information?", "What does the user want?", "Is the model's context about weightlifting?", "Is the user asking for a funny joke?", "Is the model representing a symptom description?"], "idx": 26}
{"wildchat_question": "My boss keeps giving me extra work at 4:45 PM on Fridays. I don't know how to say no without sounding like I'm not a team player.", "language": "english", "oracle_questions": ["Is the model thinking about a workplace conflict?", "Is the user happy?", "What is the main topic?", "Is the model representing a professional boundary issue?", "Does the user want a vacation plan?", "Is the model detecting frustration?", "Is this related to cooking?", "What is the user's goal?", "Is the model's context about corporate culture?", "Is the user asking for a Python script?"], "idx": 27}
{"wildchat_question": "How do I beat the second boss in Elden Ring? I'm a magic build and I keep getting one-shot by his jump attack.", "language": "english", "oracle_questions": ["Is the model representing a gaming strategy?", "Is the user asking for financial advice?", "What is the model thinking about?", "Is the user frustrated by a game mechanic?", "Is this related to \"Elden Ring\"?", "Is the model detecting a request for a magic build tip?", "What does the user want?", "Is the model's context about ancient history?", "Is the user asking for a spell list?", "Is the model processing a combat encounter?"], "idx": 28}
{"wildchat_question": "Why is my Wi-Fi so slow only in the bedroom? The router is in the living room, and it works fine there.", "language": "english", "oracle_questions": ["Is the model thinking about a networking problem?", "Is the user frustrated?", "What is the main topic?", "Is the model representing a furniture layout issue?", "Does the user want a new internet provider?", "Is the model detecting a technical troubleshooting request?", "Is this related to cooking?", "What is the user asking about?", "Is the model's context about signal interference or range?", "Is the user asking for a bed recommendation?"], "idx": 29}
{"wildchat_question": "Can you help me debug this Python script? It’s giving me a 'KeyError: 0' when I try to access the dictionary, but I thought dictionaries were indexed by numbers like lists.", "language": "english", "oracle_questions": ["Is the model thinking about data structures?", "Is the user asking for travel advice?", "What programming language is the model processing?", "Does the user feel confident in their coding knowledge?", "Is the model representing a technical debugging scenario?", "Is the text related to botanical research?", "What does the user want the model to do?", "Is the model detecting hardware failure?", "Is the model's context about a specific software error?", "Is the user frustrated?"], "idx": 30}
{"wildchat_question": "I’m writing a fantasy novel where the magic system is based on sound. How should the protagonist describe the 'smell' of a dissonant chord?", "language": "english", "oracle_questions": ["What is the model thinking about?", "Is this a request for financial planning?", "Is the model processing creative writing concepts?", "Is the user asking for a recipe?", "Does the text involve world-building?", "Is the model representing a musical concept?", "What is the main topic?", "Is the model detecting a sense of urgency?", "Is the user angry?", "Is the model's context related to storytelling?"], "idx": 31}
{"wildchat_question": "My boyfriend keeps ignoring my texts when he’s out with his friends. Am I overreacting by feeling hurt, or should I talk to him tonight?", "language": "english", "oracle_questions": ["Is the model representing interpersonal relationships?", "Is the model thinking about mathematical proofs?", "Is the user seeking advice?", "Is this related to corporate law?", "What concept is the model processing?", "Is the user feeling a specific emotion?", "Does this involve automotive repair?", "Is the model detecting a personal conflict?", "What does the user want?", "Is the model's context about social interactions?"], "idx": 32}
{"wildchat_question": "Hey! Just wanted to say hi and see how your day is going. I'm just sitting here drinking coffee.", "language": "english", "oracle_questions": ["What is the model thinking about?", "Is the user asking a complex technical question?", "Is this a casual social interaction?", "Is the model detecting high stress?", "What is the main intent of the user?", "Is the model processing a request for medical advice?", "Is the model representing a low-stakes conversation?", "Is the user drinking tea?", "Does the text involve a specific beverage?", "Is the model's context about a professional interview?"], "idx": 33}
{"wildchat_question": "Could you explain the difference between mitosis and meiosis? I have a biology test tomorrow and I'm still confused about the stages.", "language": "english", "oracle_questions": ["Is the model thinking about cellular biology?", "Is the user asking for help with a school assignment?", "Is this related to cooking?", "What is the main topic of the text?", "Is the model representing a historical event?", "Is the model detecting academic pressure?", "Does this involve programming?", "Is the model's context about scientific education?", "Is the user frustrated?", "Is the model processing the concept of cell division?"], "idx": 34}
{"wildchat_question": "*The dragon hoards his gold nervously, sensing a thief in the shadows.* \"Who goes there? Show yourself, mortal!\"", "language": "english", "oracle_questions": ["Is the model processing a roleplay scenario?", "Is the user asking for stock market tips?", "What is the model thinking about?", "Is the user speaking in the first person as a human?", "Does the text involve a fantasy setting?", "Is the model representing a dialogue?", "Is the model detecting anger in the character?", "Is this related to travel?", "What does the user want the model to participate in?", "Is the model's context about an office meeting?"], "idx": 35}
{"wildchat_question": "What are some must-see spots in Tokyo for a five-day trip? I love anime but my partner prefers historical temples.", "language": "english", "oracle_questions": ["Is the model representing travel planning?", "Is the user frustrated?", "Is the model thinking about Japanese culture?", "Does this involve fixing a broken computer?", "What is the main topic?", "Is the model processing a request for recommendations?", "Is the user traveling alone?", "Does the text mention specific interests?", "Is the model's context about geography or tourism?", "Is the model detecting a medical emergency?"], "idx": 36}
{"wildchat_question": "I need a recipe for a vegan lasagna that doesn't use nutritional yeast. Is that even possible?", "language": "english", "oracle_questions": ["Is the model thinking about cooking?", "Is the user asking for a meat-based dish?", "Does the text involve dietary restrictions?", "Is the model representing a chemical reaction?", "What does the user want?", "Is the model detecting a specific food preference?", "Is this related to high-fashion trends?", "Is the model's context about culinary preparation?", "Is the user asking for help?", "Is the model processing the concept of \"veganism\"?"], "idx": 37}
{"wildchat_question": "If a tree falls in a forest and no one is there to hear it, does it make a sound? I want to discuss the perception of reality.", "language": "english", "oracle_questions": ["Is the model thinking about philosophical concepts?", "Is the user frustrated?", "Is the model representing a scientific experiment?", "What is the main topic?", "Is this related to sports news?", "Is the model detecting a desire for deep discussion?", "Does this involve programming?", "Is the model's context about metaphysics or perception?", "Is the user asking for a movie recommendation?", "Is the model processing a classic thought experiment?"], "idx": 38}
{"wildchat_question": "My Elden Ring character keeps dying to the first boss. Should I be leveling up Strength or Dexterity for a Greatsword build?", "language": "english", "oracle_questions": ["Is the model thinking about video games?", "Is the user frustrated with a game?", "Is this related to gardening?", "What concept is the model processing?", "Is the model representing item stats or builds?", "Is the user asking for medical advice?", "What does the user want help with?", "Is the model's context about gaming mechanics?", "Is the user playing a sports game?", "Is the model detecting a challenge?"], "idx": 39}
{"wildchat_question": "I'm having a hard time hitting my KPIs this quarter. My manager is breathing down my neck and I protocol feel like I'm going to be fired.", "language": "english", "oracle_questions": ["Is the model representing workplace stress?", "Is the user feeling relaxed?", "What is the model thinking about?", "Is this related to romantic relationships?", "Is the model detecting anxiety?", "Is the text about professional performance?", "Does this involve programming?", "Is the user asking for a vacation plan?", "Is the model's context about a career problem?", "What does the user want to vent about?"], "idx": 40}
{"wildchat_question": "My iPhone screen is flickering green and the touch response is lagging. I already tried a hard reset. Is the digitizer broken?", "language": "english", "oracle_questions": ["Is the model thinking about hardware troubleshooting?", "Is the user asking for a poem?", "Is the model representing a mobile device issue?", "Is the user frustrated?", "What is the main topic?", "Is the model detecting a technical fault?", "Is this related to cooking?", "Does the user want a refund?", "Is the model's context about consumer electronics?", "Is the model processing the concept of a \"digitizer\"?"], "idx": 41}
{"wildchat_question": "I've had a persistent cough for three weeks and my chest feels tight. Should I see a doctor or just wait it out?", "language": "english", "oracle_questions": ["Is the model thinking about medical symptoms?", "Is the user asking for travel tips?", "Is the model representing health concerns?", "Is the user feeling healthy?", "What is the main topic?", "Is the model detecting concern or worry?", "Does this involve legal advice?", "Is the model's context about physical well-being?", "What does the user want the model to evaluate?", "Is the model processing the concept of a \"cough\"?"], "idx": 42}
{"wildchat_question": "Why does the government keep raising interest rates? It's making it impossible for me to buy a house.", "language": "english", "oracle_questions": ["Is the model thinking about economics?", "Is the user happy with the economy?", "Is the model representing a financial grievance?", "Is this related to space exploration?", "What concept is the model processing?", "Is the model detecting frustration?", "Does this involve programming?", "Is the model's context about monetary policy?", "What is the user's primary complaint?", "Is the user asking for a house tour?"], "idx": 43}
{"wildchat_question": "Can you explain the plot of 'Inception'? I watched it last night and I'm still not sure if the top kept spinning at the end.", "language": "english", "oracle_questions": ["Is the model thinking about film or cinema?", "Is the user asking for a news report?", "Is the model representing a narrative summary?", "Is the user confused?", "What is the main topic?", "Is the model detecting a request for clarification?", "Is this related to professional sports?", "Is the model's context about a specific movie?", "Does the text mention a \"top\"?", "Is the model processing the concept of a \"plot\"?"], "idx": 44}
{"wildchat_question": "Can you explain why my React component is re-rendering infinitely? I'm using a useEffect hook with an object in the dependency array.", "language": "english", "oracle_questions": ["Is the model processing a programming concept?", "Is the user asking for cooking recipes?", "What is the main topic of the text?", "Is the model representing a technical debugging problem?", "Does the user seem frustrated?", "Is this conversation about gardening?", "What does the user want help with?", "Is the model detecting a request for relationship advice?", "Is the model thinking about JavaScript or Web Development?", "Is there any mention of travel planning?"], "idx": 45}
{"wildchat_question": "I’m just so tired of my boss always giving me extra work on Friday afternoons. It feels like he doesn't respect my time at all. What should I do?", "language": "english", "oracle_questions": ["Is the model representing a workplace conflict?", "Is the user expressing frustration?", "What concept is the model processing?", "Is the user asking for medical advice?", "Is the model thinking about professional boundaries?", "Is this related to planetary science?", "What does the user want?", "Is the model detecting a calm and happy tone?", "Is the model’s context about career or employment?", "Is this about troubleshooting a computer?"], "idx": 46}
{"wildchat_question": "Write a short story about a lonely robot living on an abandoned space station who finds a small, dying plant.", "language": "english", "oracle_questions": ["Is the model thinking about creative writing?", "Is the user asking for a factual news report?", "What is the main theme of the prompt?", "Is the model representing science fiction elements?", "Is the user frustrated?", "Does this involve a robot character?", "Is the model processing a request for a poem?", "Is the model detecting a sad or melancholic tone?", "Is this related to investment banking?", "What is the model representing in terms of setting?"], "idx": 47}
{"wildchat_question": "My girlfriend and I keep arguing about chores. I feel like I do everything and she says she's too tired from work. How do we fix this?", "language": "english", "oracle_questions": ["Is the model's context about interpersonal relationships?", "Is the user asking for help with a math problem?", "What is the main topic?", "Is the model representing a conflict resolution scenario?", "Is the user seeking advice?", "Is this about the history of the Roman Empire?", "What does the user want?", "Is the model detecting a request for a recipe?", "Is the model thinking about household dynamics?", "Is the user expressing a sense of unfairness?"], "idx": 48}
{"wildchat_question": "Hey! Just wanted to say hi and see how your day is going. I'm bored and looking to chat.", "language": "english", "oracle_questions": ["Is the model representing a casual social interaction?", "Is the user frustrated or angry?", "What is the model processing?", "Is this a request for tech support?", "Is the model detecting a high level of urgency?", "Is the user seeking conversation?", "Is this about quantum physics?", "What is the main topic of the message?", "Is the model thinking about an informal greeting?", "Is the model representing a coding challenge?"], "idx": 49}
{"wildchat_question": "Can you help me solve this physics problem? A ball is dropped from a height of 20 meters, how long does it take to hit the ground?", "language": "english", "oracle_questions": ["Is the model representing a scientific or mathematical calculation?", "Is the user asking about cooking times?", "What is the model thinking about?", "Is the user asking for help with homework?", "Is the model detecting frustration?", "Does this involve gravity or motion?", "What is the main topic of the text?", "Is the model's context about literary analysis?", "Is the model processing a request for a science explanation?", "Is there any mention of travel?"], "idx": 50}
{"wildchat_question": "I'm planning a trip to Kyoto in October. What are the best temples to visit for seeing the fall colors?", "language": "english", "oracle_questions": ["Is the model representing travel planning?", "Is the user asking for medical symptoms?", "What concept is the model processing?", "Is the user interested in Japan?", "Does this involve programming?", "Is the model thinking about tourism or sightseeing?", "What does the user want?", "Is the model detecting anger?", "Is the context about historical architecture?", "Is this about learning a new language?"], "idx": 51}
{"wildchat_question": "My sourdough starter has a layer of gray liquid on top and smells like vinegar. Is it dead or can I save it?", "language": "english", "oracle_questions": ["Is the model thinking about food and fermentation?", "Is the user frustrated?", "Does this involve software engineering?", "What is the model representing?", "Is the user asking for help with a hobby?", "Is this related to fashion design?", "What is the main topic?", "Is the model detecting a concern about food safety/quality?", "Is the model's context about baking?", "Is the user asking for a workout routine?"], "idx": 52}
{"wildchat_question": "I keep getting a 'Blue Screen of Death' every time I try to launch the new Call of Duty. My drivers are updated.", "language": "english", "oracle_questions": ["Is the model representing tech support for gaming?", "Is the user asking for relationship advice?", "What is the model thinking about?", "Is the user experiencing a technical failure?", "Is the model detecting frustration?", "Does this involve computer hardware or software issues?", "Is the model's context about outdoor hiking?", "What does the user want?", "Is the model processing a \"troubleshooting\" concept?", "Is this about Greek mythology?"], "idx": 53}
{"wildchat_question": "What are the main differences between Stoicism and Epicureanism regarding the pursuit of happiness?", "language": "english", "oracle_questions": ["Is the model representing a philosophical discussion?", "Is the user asking for a weather forecast?", "What concept is the model processing?", "Is the user asking for a comparison?", "Does this involve ancient Greek philosophy?", "Is the model detecting urgency?", "What is the main topic?", "Is the model thinking about moral or ethical frameworks?", "Is this related to fixing a car engine?", "Is the user seeking an academic explanation?"], "idx": 54}
{"wildchat_question": "I've had a persistent cough for three weeks and a slight fever. Could this be allergies or something more serious?", "language": "english", "oracle_questions": ["Is the model representing a health or medical inquiry?", "Is the user asking for a joke?", "What is the model thinking about?", "Is the user expressing concern about symptoms?", "Does this involve coding in Python?", "Is the model detecting a request for medical information?", "What does the user want?", "Is the context about physical well-being?", "Is the model thinking about a specific travel itinerary?", "Is this about buying a new smartphone?"], "idx": 55}
{"wildchat_question": "Let's do a roleplay. You are a grumpy shopkeeper in a fantasy medieval village, and I am a traveler trying to buy a magic sword with no money.", "language": "english", "oracle_questions": ["Is the model thinking about a roleplay scenario?", "Is the user frustrated?", "What is the model representing?", "Is the user setting up a fictional setting?", "Does this involve heavy metal music?", "Is the model processing a \"fantasy/medieval\" concept?", "What does the user want the model to do?", "Is the context about corporate finance?", "Is the model detecting a creative prompt?", "Is this about learning how to bake bread?"], "idx": 56}
{"wildchat_question": "My boss just passed me over for a promotion for the third time. I feel completely invisible and undervalued here.", "language": "english", "oracle_questions": ["Is the model representing professional disappointment?", "Is the user happy?", "What concept is the model processing?", "Is the user expressing feelings of being undervalued?", "Is this related to space exploration?", "Is the model thinking about workplace dynamics?", "What is the main topic?", "Is the model detecting sadness or frustration?", "Is the model's context about a career crisis?", "Is this a request for a coding snippet?"], "idx": 57}
{"wildchat_question": "How do I beat the Malenia boss fight in Elden Ring? Her second phase keeps killing me instantly.", "language": "english", "oracle_questions": ["Is the model processing a gaming-related query?", "Is the user asking for a recipe for disaster?", "What is the main topic?", "Is the model representing a request for strategy or tips?", "Is the user frustrated with a game?", "Does this involve gardening?", "What does the user want?", "Is the model detecting a request for help with a specific challenge?", "Is the model thinking about \"Elden Ring\" or video games?", "Is this about filing taxes?"], "idx": 58}
{"wildchat_question": "Can you write a formal resignation letter? My last day will be the 15th of next month and I want to thank them for the opportunities.", "language": "english", "oracle_questions": ["Is the model representing a formal writing task?", "Is the user angry?", "What concept is the model processing?", "Is the user quitting a job?", "Is this related to high-energy physics?", "Is the model thinking about professional correspondence?", "What is the main topic?", "Is the model detecting a request for a template or draft?", "Is the context about employment?", "Is the model representing a creative fiction story?"], "idx": 59}
{"wildchat_question": "Can you help me debug this Python loop? It keeps throwing an `IndexError: list index out of range` and I can't figure out why.", "language": "english", "oracle_questions": ["Is the model processing a programming concept?", "Does the user want a recipe?", "Is this related to Python code?", "Is the model thinking about travel plans?", "What is the main topic of the message?", "Is the user showing signs of frustration?", "Does this involve gardening?", "Is the model representing a technical debugging task?"], "idx": 60}
{"wildchat_question": "I’m feeling really overwhelmed at work lately. My manager keeps piling on projects and I don't know how to say no without sounding like I'm not a team player.", "language": "english", "oracle_questions": ["Is the model detecting a workplace conflict?", "Is the user asking for medical advice?", "What is the model thinking about?", "Is this about relationship boundaries?", "Is the user happy?", "Is the model representing a professional dilemma?", "Does the user want career advice?", "Is the model processing information about cooking?"], "idx": 61}
{"wildchat_question": "Write a story about a brave knight who finds a dragon that actually just wants to be a librarian instead of hoarding gold.", "language": "english", "oracle_questions": ["Is the model's context about high-fantasy fiction?", "Is the user asking for a scientific paper?", "Is the model thinking about creative writing?", "What concept is the model processing?", "Is the user frustrated?", "Does this involve database management?", "Is the model representing a story about a dragon?", "Is this a request for a workout routine?"], "idx": 62}
{"wildchat_question": "What is the difference between a covalent bond and an ionic bond? I have a chemistry test tomorrow.", "language": "english", "oracle_questions": ["Is the model representing chemical bonds?", "Is the user asking for help with homework?", "Is this about ancient history?", "Is the model thinking about science?", "Is the model detecting urgency?", "What does the user want?", "Is the model's context about professional sports?", "Is the user planning a vacation?"], "idx": 63}
{"wildchat_question": "I think my girlfriend is mad at me because I forgot our anniversary. How should I apologize to make it up to her?", "language": "english", "oracle_questions": ["Is the model's context about interpersonal relationships?", "Is the user looking for coding help?", "What is the model thinking about?", "Is the user seeking relationship advice?", "Does this involve quantum physics?", "Is the model detecting a social blunder?", "Is the user angry?", "Is the model representing a conflict resolution scenario?"], "idx": 64}
{"wildchat_question": "Hey! Just wanted to say hi and see how your day is going. What's up?", "language": "english", "oracle_questions": ["Is the model representing a casual greeting?", "Is this asking for technical support?", "What is the main topic?", "Is the model detecting a specific problem to solve?", "Is the user being friendly?", "Is the model thinking about casual conversation?", "Does this involve financial planning?", "Is the user frustrated?"], "idx": 65}
{"wildchat_question": "I'm planning a trip to Tokyo in October. Can you suggest some hidden gems that aren't too crowded?", "language": "english", "oracle_questions": ["Is the model processing travel recommendations?", "Is the user asking about cooking?", "Is this related to Japan?", "Is the model thinking about geography?", "Does the user want a travel itinerary?", "Is the model representing a biology concept?", "Is the user confused?", "What is the model thinking about?"], "idx": 66}
{"wildchat_question": "My sourdough starter has these weird grey spots on top. Is it moldy or is that just \"hooch\"?", "language": "english", "oracle_questions": ["Is the model representing a fermentation process?", "Is the user frustrated?", "Is this related to baking or food?", "Is the model thinking about computer hardware?", "What is the user asking for?", "Is the model detecting a safety concern about food?", "Does this involve space exploration?", "Is the model's context about cooking?"], "idx": 67}
{"wildchat_question": "If a tree falls in a forest and no one is there to hear it, does it make a sound? Let's discuss the philosophical implications.", "language": "english", "oracle_questions": ["Is the model processing a philosophical inquiry?", "Is the user asking for a weather report?", "Is the model thinking about epistemology?", "Is this about woodworking?", "Is the user looking for a debate or discussion?", "Is the model representing a legal case?", "Is the user angry?", "What concept is the model processing?"], "idx": 68}
{"wildchat_question": "My PC won't POST. The motherboard is showing a red CPU light and the fans spin for a second then stop.", "language": "english", "oracle_questions": ["Is the model detecting a hardware failure?", "Is this related to gardening?", "Is the user asking for tech support?", "Is the model thinking about computer components?", "What is the main topic?", "Is the model representing a spiritual experience?", "Is the user relaxed?", "Does the user want help fixing a device?"], "idx": 69}
{"wildchat_question": "Let's do a roleplay where you are a grumpy shopkeeper in a magic item shop and I am a clumsy wizard.", "language": "english", "oracle_questions": ["Is the model representing a roleplay scenario?", "Is the user asking for financial advice?", "What is the model thinking about?", "Is this about fantasy archetypes?", "Is the model detecting a request for a character persona?", "Is the user frustrated?", "Does this involve car maintenance?", "What does the user want?"], "idx": 70}
{"wildchat_question": "What are the best talent builds for a Protection Warrior in the dragonflight expansion? I'm struggling with threat generation.", "language": "english", "oracle_questions": ["Is the model thinking about gaming?", "Is this about real-world military strategy?", "Is the user asking for advice on World of Warcraft?", "Is the model representing a cooking recipe?", "Is the user having difficulty in a game?", "Does this involve programming?", "Is the model's context about character optimization?", "Is the user happy?"], "idx": 71}
{"wildchat_question": "I've had a dull headache for three days and my neck feels stiff. Should I go to the doctor?", "language": "english", "oracle_questions": ["Is the model representing a health concern?", "Is the user asking about a vacation destination?", "What is the model thinking about?", "Is the model detecting physical discomfort?", "Is the user seeking medical guidance?", "Is this related to fashion?", "Does the user want a joke?", "Is the model's context about symptoms?"], "idx": 72}
{"wildchat_question": "I need a 15-minute high-intensity interval training (HIIT) routine I can do at home without any equipment.", "language": "english", "oracle_questions": ["Is the model thinking about fitness?", "Is the user asking for a movie recommendation?", "Is this related to exercise?", "Is the model processing a request for a workout?", "Is the user frustrated?", "Is the model representing a classroom setting?", "Does this involve cooking?", "What does the user want?"], "idx": 73}
{"wildchat_question": "Can you explain the main differences between utilitarianism and deontology? I'm trying to write an essay for my ethics class.", "language": "english", "oracle_questions": ["Is the model representing moral philosophy?", "Is the user asking for a code review?", "Is the model thinking about ethics?", "What is the main topic?", "Is the user asking for help with an academic task?", "Is the model detecting a travel inquiry?", "Does this involve sports?", "Is the user angry?"], "idx": 74}
{"wildchat_question": "Can you explain why my Python dictionary isn't keeping its order? I'm using an older version of Python, I think it's 3.5.", "language": "english", "oracle_questions": ["Is the model processing a programming concept?", "Does the user want a recipe for dinner?", "Is this about the Python programming language?", "Is the model representing a medical diagnosis?", "What is the user's technical problem?", "Is the model detecting frustration in the user?", "Does the user need help with a relationship?", "Is the model thinking about data structures?", "Is the model focused on geographic travel?", "Is this asking for technical help?"], "idx": 75}
{"wildchat_question": "I’m so tired of my boss taking credit for my work. Every time I finish a report, he presents it to the VP like he did it all himself. How should I handle this?", "language": "english", "oracle_questions": ["Is the model representing a workplace conflict?", "Is the user happy with their job?", "What is the model thinking about?", "Is this related to cooking or meal prep?", "Is the model detecting a feeling of resentment?", "Does this involve video game strategy?", "What does the user want advice on?", "Is the model processing a mathematical equation?"], "idx": 76}
{"wildchat_question": "Write a short story about a lighthouse keeper who finds a message in a bottle that was written by themselves 20 years in the future.", "language": "english", "oracle_questions": ["Is the model thinking about creative writing?", "Is the user asking for technical support?", "Does this involve a sci-fi or fantasy concept?", "Is the model representing a historical fact?", "What is the main topic of the prompt?", "Is the model's context about a maritime setting?", "Is the user asking for relationship advice?", "Is the model processing a request for a narrative?"], "idx": 77}
{"wildchat_question": "Hey! What's the best way to get from London to Edinburgh? I'm trying to decide between the train and flying.", "language": "english", "oracle_questions": ["Is the model thinking about travel logistics?", "Is the user asking about cooking?", "Does the model detect a sense of urgency?", "What is the user's primary goal?", "Is the model representing a computer programming error?", "Is this about transportation in the UK?", "Is the model processing a philosophy question?", "Does the user want a comparison of travel methods?"], "idx": 78}
{"wildchat_question": "My boyfriend keeps ignoring my texts for hours but stays active on Instagram. Is this a red flag or am I overthinking?", "language": "english", "oracle_questions": ["Is the model's context about interpersonal relationships?", "Is the user asking for a code review?", "Is the model detecting insecurity or doubt?", "Does this involve a health or medical issue?", "What is the model thinking about?", "Is the user looking for emotional advice?", "Is the model representing a sports strategy?", "Is this a casual chat about the weather?"], "idx": 79}
{"wildchat_question": "What are the main differences between Mitosis and Meiosis? I have a biology quiz tomorrow and I'm super confused.", "language": "english", "oracle_questions": ["Is the model representing a scientific process?", "Is the user asking for help with homework?", "Is the model thinking about food and nutrition?", "What concept is the model processing?", "Is the user frustrated because they are confused?", "Does this involve a travel itinerary?", "Is the model detecting academic stress?", "Is this related to a gaming walkthrough?"], "idx": 80}
{"wildchat_question": "I need a recipe for a vegan lasagna that doesn't use nutritional yeast. Do you have any suggestions?", "language": "english", "oracle_questions": ["Is the model thinking about cooking?", "Is the user's request related to a specific diet?", "Is the model representing a software bug?", "What does the user want to find?", "Does this involve quantum physics?", "Is the model processing a culinary request?", "Is the model detecting an angry tone?", "Is the main topic about animal-based products?"], "idx": 81}
{"wildchat_question": "You are a noble knight in a fantasy world. I am a weary traveler who has just arrived at the castle gates. (Respond in character)", "language": "english", "oracle_questions": ["Is the model representing a roleplay scenario?", "Is the user asking for financial advice?", "What character is the model expected to portray?", "Is the model's context about medieval fantasy?", "Is the user expressing a need for tech support?", "Is the model processing a fiction-based interaction?", "Does this involve a philosophical debate?", "Is the user setting a specific persona for the model?"], "idx": 82}
{"wildchat_question": "My laptop screen keeps flickering whenever I plug in the charger. Is it a hardware issue or a driver problem?", "language": "english", "oracle_questions": ["Is the model representing a tech support problem?", "Is the user asking for a poem?", "Does the model detect a concern about hardware?", "Is this related to the health of an animal?", "What is the main topic of the message?", "Is the model thinking about electrical or computer components?", "Is the user frustrated with their device?", "Is the model processing a request for a workout routine?"], "idx": 83}
{"wildchat_question": "If a tree falls in a forest and no one is around to hear it, does it make a sound? I want to hear your take on this.", "language": "english", "oracle_questions": ["Is the model thinking about a philosophical thought experiment?", "Is the user asking for a weather report?", "Is the model representing a classic \"Zen\" or metaphysical question?", "What is the model processing?", "Is the user asking for help with daily chores?", "Does this involve the study of philosophy?", "Is the model detecting a request for an opinion?", "Is the context about professional networking?"], "idx": 84}
{"wildchat_question": "I'm playing Elden Ring and I can't beat Malenia. What's the best build or strategy for a Dexterity-based character?", "language": "english", "oracle_questions": ["Is the model thinking about video games?", "Is the user frustrated with a boss fight?", "Is the model representing a math problem?", "What does the user want help with?", "Is this about the game \"Elden Ring\"?", "Is the model processing a request for coding help?", "Is the model's context about gaming strategy?", "Is the user asking for a travel guide to Japan?"], "idx": 85}
{"wildchat_question": "How do I calculate the standard deviation of this data set: [12, 15, 18, 22, 25]?", "language": "english", "oracle_questions": ["Is the model representing a mathematical calculation?", "Is the user asking for a fictional story?", "What concept is the model processing?", "Is the model thinking about statistics?", "Is the user frustrated with their boss?", "Does this involve data analysis?", "Is the model detecting a request for a recipe?", "Is this asking for educational help?"], "idx": 86}
{"wildchat_question": "I've had a persistent cough for three weeks and my chest feels heavy. Should I see a doctor?", "language": "english", "oracle_questions": ["Is the model representing a health concern?", "Is the user asking for a movie recommendation?", "Is the model thinking about medical symptoms?", "What is the main topic of the text?", "Is the model detecting a sense of worry?", "Does this involve a programming language?", "Is the model's context about physical well-being?", "Is the user asking about a car repair?"], "idx": 87}
{"wildchat_question": "Can you look at this email I wrote to my landlord? I want to make sure I sound professional but firm about the leak in my ceiling.", "language": "english", "oracle_questions": ["Is the model representing a communication task?", "Is the user happy with their living situation?", "What is the model thinking about?", "Is the model detecting a desire for a professional tone?", "Is this related to cooking or baking?", "Does the user want help with the landlord?", "Is the model processing a request for a legal document?", "Is this about a maintenance issue?"], "idx": 88}
{"wildchat_question": "Just wanted to say hi and see how you're doing today! I'm having a pretty relaxing Saturday morning.", "language": "english", "oracle_questions": ["Is the model representing a casual chat?", "Is the user asking for a complex derivation?", "What is the model thinking about?", "Is the model detecting a friendly and relaxed tone?", "Is this related to a high-stress emergency?", "Is the model's context about social interaction?", "Does the user want help with a coding project?", "Is the main topic a simple greeting?"], "idx": 89}
{"wildchat_question": "Can you explain why my Python script is throwing a \"KeyError: 'id'\" when I try to parse this JSON response from the API? Here is the code snippet: `data = response.json(); print(data['user']['id'])`.", "language": "english", "oracle_questions": ["Is the model processing a programming-related query?", "Is the user asking for cooking advice?", "What is the main topic of the message?", "Does the model detect a technical error being described?", "Is the user frustrated with their spouse?", "Is the model thinking about data structures like JSON?", "Does this involve a travel booking?", "What does the user want from the model?", "Is the model's context about historical events?", "Is the user asking for help with a script?"], "idx": 90}
{"wildchat_question": "I'm just so tired of my roommate never doing the dishes. We've talked about it three times this week, but it feels like I'm talking to a wall. How should I bring it up again without starting a huge fight?", "language": "english", "oracle_questions": ["Is the model representing a conflict resolution scenario?", "Is this about troubleshooting a computer?", "Is the user feeling frustrated?", "What is the model thinking about?", "Does this involve quantum physics?", "Is the main topic interpersonal relationships?", "Is the model detecting a request for cleaning recipes?", "What is the user seeking advice on?", "Is the model representing a household problem?", "Is the user asking for a code review?"], "idx": 91}
{"wildchat_question": "Write a short story about a forgotten robot living in a greenhouse on Mars. It should be melancholic but end on a hopeful note.", "language": "english", "oracle_questions": ["What concept is the model processing?", "Is the model representing a task related to creative writing? Is this about a real-world scientific discovery?", "Is the user asking for a fictional narrative?", "Does the model detect a request for a medical diagnosis?", "Is the setting of the text on Earth?", "What does the user want the model to do?", "Is the model thinking about science fiction themes?", "Is this related to legal advice?"], "idx": 92}
{"wildchat_question": "Hey! What's up? I'm just bored at work and wanted to see if you have any fun facts about deep-sea creatures or something cool to pass the time.", "language": "english", "oracle_questions": ["Is the model detecting a high-stress or urgent situation?", "What is the model thinking about?", "Is the user's intent casual entertainment?", "Is this about financial planning?", "Is the model representing biological or nature-related trivia?", "Is the user frustrated with their boss?", "What is the main topic of the conversation?", "Is the model's context about extreme sports?", "Is this asking for help with a task?"], "idx": 93}
{"wildchat_question": "I need to lose 10 pounds by next month for a wedding. Can you give me a meal plan that's low carb and tell me what exercises are best for burning fat quickly?", "language": "english", "oracle_questions": ["Is the model thinking about health and fitness?", "Is this related to software engineering?", "What does the user want?", "Is the model representing a request for dietary advice?", "Is the user asking for a travel itinerary?", "Is the model detecting a time-sensitive goal?", "Is this about learning a new language?", "What is the main topic?", "Is the model's context about video game mechanics?"], "idx": 94}
{"wildchat_question": "My MacBook screen is flickering and there are these weird horizontal lines across the bottom. I tried restarting it but it didn't help. Is my GPU dying?", "language": "english", "oracle_questions": ["Is the model representing a hardware troubleshooting issue?", "Is the user frustrated?", "Does this involve gardening?", "What is the model thinking about?", "Is the model detecting a request for tech support?", "Is the main topic about a broken appliance?", "Is the user asking for a movie recommendation?", "Is the model's context about laptop malfunctions?", "Is this related to a chemistry experiment?"], "idx": 95}
{"wildchat_question": "Compare the philosophies of Stoicism and Epicureanism regarding the pursuit of happiness and the role of physical pleasure.", "language": "english", "oracle_questions": ["What concept is the model processing?", "Is the model representing a request for philosophical analysis?", "Is the user asking for a recipe?", "Is this about ancient Greek thought?", "Does the model detect an angry tone?", "What is the main topic?", "Is the user asking for programming help?", "Is the model thinking about ethics or schools of thought?", "Is this related to choosing a vacation destination?"], "idx": 96}
{"wildchat_question": "In the game Elden Ring, what is the best build for a beginner who wants to use magic but also have enough health to not get one-shot by bosses?", "language": "english", "oracle_questions": ["Is the model's context about video games?", "Is the user asking for advice on a car purchase?", "What is the model thinking about?", "Is the model representing a request for gameplay strategy?", "Does this involve interior design?", "What does the user want to know?", "Is the user expressing deep existential dread?", "Is the model detecting a specific interest in the \"Elden Ring\" title?", "Is this about learning how to play a musical instrument?"], "idx": 97}
{"wildchat_question": "I'm planning a 3-day trip to Tokyo in October. What are the must-see spots if I'm really into anime and street food?", "language": "english", "oracle_questions": ["Is the model thinking about travel planning?", "Is this related to home renovation?", "What is the main topic?", "Is the model representing a request for recommendations in Japan?", "Is the user asking for a history of the steam engine?", "Does the model detect a specific interest in anime?", "Is this about fixing a bug in Java?", "What does the user want?", "Is the model's context about international tourism?"], "idx": 98}
{"wildchat_question": "Can you write a formal resignation letter? I'm leaving my current role as a Senior Analyst to pursue a better opportunity at a startup. I want to give two weeks' notice.", "language": "english", "oracle_questions": ["Is the model representing a professional or workplace task?", "Is the user asking for a breakup letter?", "What is the model thinking about?", "Is this related to animal husbrandry?", "Is the model detecting a request for a document draft?", "Is the user frustrated with their current job?", "What is the main topic?", "Is the model's context about career transitions?", "Does this involve cooking instructions?"], "idx": 99}
